app/views/users/show.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 6 AND "posts"."published" = 1
---
        <div>
          <p class="text-2xl font-bold text-gray-900"><%= @user.posts.published.count %></p>