app/views/tags/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 6
---
                <% else %>
                  <span class="text-sm font-bold text-gray-600"><%= post.user.display_name.first.upcase %></span>

SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 11 AND "tags"."id" != 2 LIMIT 3
---

            <% post.tags.where.not(id: @tag.id).limit(3).each do |tag| %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 11
---
                </svg>
                <span><%= post.comments.count %></span>