app/views/posts/_like_button.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (10, 9, 8, 7, 6, 5, 3, 2, 1)
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 3
---
        <span class="text-sm font-medium">
          <%= post.likes.count %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 14
---
        <span class="text-sm font-medium">
          <%= post.likes.count %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = 14
---
      <span class="text-sm">
        <%= post.likes.count %>