app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN (6, 5, 4, 3, 2, 1)
---
                <% else %>
                  <span class="text-sm font-bold text-gray-600"><%= post.user.display_name.first.upcase %></span>

SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 13 LIMIT 3
---
              <% if post.tags.any? %>
                <% post.tags.limit(3).each do |tag| %>

SELECT COUNT(*) FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 13
SELECT COUNT(*) FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 11
---
                <% end %>
                <% if post.tags.count > 3 %>
                  <span class="text-xs text-gray-500">+<%= post.tags.count - 3 %>個</span>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 14
---
                </svg>
                <span class="text-sm"><%= post.comments.count %></span>