app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1
---
          <div class="w-10 h-10 sm:w-12 sm:h-12 rounded-full bg-gray-300 flex items-center justify-center flex-shrink-0">
            <span class="text-sm font-bold text-gray-600"><%= @post.user.display_name.first.upcase %></span>

SELECT 1 AS one FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 13 LIMIT 1
SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 13
---

      <% if @post.tags.any? %>
        <% @post.tags.each do |tag| %>