app/views/posts/timeline.html.erb

                <% else %>
                  <span class="text-sm font-bold text-gray-600"><%= post.user.display_name.first.upcase %></span>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 6

          <!-- Category and Tags -->
          <% if post.category || post.tags.any? %>
---
SELECT 1 AS one FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 14 LIMIT 1


              <% if post.tags.any? %>
                <% post.tags.limit(3).each do |tag| %>
---
SELECT 1 AS one FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 13 LIMIT 1
SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 13 LIMIT 3

                <% end %>
                <% if post.tags.count > 3 %>
                  <span class="text-xs text-gray-500">+<%= post.tags.count - 3 %>個</span>
---
SELECT COUNT(*) FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 13
SELECT COUNT(*) FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 11

                </svg>
                <span><%= post.comments.count %></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 14