app/controllers/categories_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."category_id" IN (3, 1, 2, 4, 5)
---
  def index
    @categories = Category.ordered.includes(:posts)