app/controllers/comments_controller.rb

UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "This is an updated comment body that is long enough."], ["updated_at", "2025-10-06 03:54:28.178138"], ["id", 1]]
---
  def update
    if @comment.update(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_comment
    @comment = @post.comments.find(params[:id])