app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (1, 2)
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (10, 9, 8, 7, 6, 5, 3, 2, 1)
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (10, 9, 8, 7, 6, 5, 3, 2, 1)
SELECT "post_tags".* FROM "post_tags" WHERE "post_tags"."post_id" IN (14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 3, 2, 1)
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
  def index
    @posts = Post.published.includes(:user, :likes, :comments, :category, :tags)
    @categories = Category.order(:name)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (13, 12, 11)
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (13, 12, 11)
SELECT "posts".* FROM "posts" WHERE "posts"."published" = 1 AND "posts"."user_id" = 6 ORDER BY "posts"."created_at" DESC
---
  def timeline
    if user_signed_in?
      # Get posts from users the current user is following, plus their own posts
      following_ids = current_user.following.pluck(:id)
      @posts = Post.published
                   .includes(:user, :likes, :comments)
                   .where(user_id: [ following_ids + [ current_user.id ] ].flatten)
                   .order(created_at: :desc)

INSERT INTO "posts" ("title", "content", "author", "published", "created_at", "updated_at", "user_id") VALUES ('テスト投稿', 'test test test', NULL, 1, '2025-10-05 13:19:53.435978', '2025-10-05 13:19:53.435978', 6) RETURNING "id"
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ?, "slug" = ? WHERE "posts"."id" = ?  [["title", "Updated Title"], ["content", "Updated content that is long enough for validation."], ["updated_at", "2025-10-06 02:52:36.965264"], ["slug", "updated-title"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post.destroy!

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["post_id", 1], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def unlike
    @like = @post.likes.find_by(user: current_user)

    if @like&.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = '13' LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 13 LIMIT 1
---
    def set_post
      @post = Post.find_by!(slug: params[:id]) || Post.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      @post = Post.find(params[:id])