app/controllers/tags_controller.rb

SELECT "post_tags".* FROM "post_tags" WHERE "post_tags"."tag_id" IN (4, 3, 2, 1, 7, 5, 6, 9, 8)
SELECT "posts".* FROM "posts" WHERE "posts"."id" IN (11, 12, 13)
---
  def index
    @tags = Tag.ordered.includes(:posts)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 11
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 11
SELECT "posts".* FROM "posts" INNER JOIN "post_tags" ON "posts"."id" = "post_tags"."post_id" WHERE "post_tags"."tag_id" = 2 AND "posts"."published" = 1 ORDER BY "posts"."created_at" DESC
---
  def show
    @posts = @tag.posts.published.includes(:user, :likes, :comments, :category).recent

SELECT "tags".* FROM "tags" WHERE "tags"."id" = 2 LIMIT 1
---
  def set_tag
    @tag = Tag.find(params[:id])