app/controllers/users_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 5 AND "posts"."published" = 1 ORDER BY "posts"."created_at" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 5 AND "posts"."published" = 1
---
  def show
    @posts = @user.posts.published.recent.page(params[:page]).per(10)