app/models/post.rb

  def tag_names=(names)
    self.tags = Tag.find_or_create_by_names(names)
---
INSERT INTO "post_tags" ("post_id", "tag_id", "created_at", "updated_at") VALUES (11, 2, '2025-10-05 13:40:35.669710', '2025-10-05 13:40:35.669710') RETURNING "id"
SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = 11