app/models/tag.rb

INSERT INTO "tags" ("name", "color", "created_at", "updated_at") VALUES ('学習', '#3B82F6', '2025-10-05 13:40:35.712110', '2025-10-05 13:40:35.712110') RETURNING "id"
SELECT 1 AS one FROM "tags" WHERE "tags"."name" = '学習' LIMIT 1
SELECT "tags".* FROM "tags" WHERE "tags"."name" = 'rails' LIMIT 1
---
  def self.find_or_create_by_names(tag_names)
    return [] if tag_names.blank?

    names = tag_names.split(',').map(&:strip).compact_blank.uniq
    names.map do |name|